; domain
(define (domain miconic)
  (:requirements :typing :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem miconic-prob-12f-12p)
  (:domain miconic)

  (:objects
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 f9 f10 f11 f12 - floor
  )

  (:init
    (origin p1 f10)
    (destin p1 f5)
    (not-boarded p1)
    (not-served p1)
    (origin p2 f1)
    (destin p2 f5)
    (not-boarded p2)
    (not-served p2)
    (origin p3 f1)
    (destin p3 f9)
    (not-boarded p3)
    (not-served p3)
    (origin p4 f11)
    (destin p4 f2)
    (not-boarded p4)
    (not-served p4)
    (origin p5 f12)
    (destin p5 f5)
    (not-boarded p5)
    (not-served p5)
    (origin p6 f2)
    (destin p6 f6)
    (not-boarded p6)
    (not-served p6)
    (origin p7 f3)
    (destin p7 f6)
    (not-boarded p7)
    (not-served p7)
    (origin p8 f4)
    (destin p8 f7)
    (not-boarded p8)
    (not-served p8)
    (origin p9 f11)
    (destin p9 f2)
    (not-boarded p9)
    (not-served p9)
    (origin p10 f6)
    (destin p10 f2)
    (not-boarded p10)
    (not-served p10)
    (origin p11 f11)
    (destin p11 f12)
    (not-boarded p11)
    (not-served p11)
    (origin p12 f3)
    (destin p12 f4)
    (not-boarded p12)
    (not-served p12)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f1 f9)
    (above f1 f10)
    (above f1 f11)
    (above f1 f12)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f2 f9)
    (above f2 f10)
    (above f2 f11)
    (above f2 f12)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f3 f9)
    (above f3 f10)
    (above f3 f11)
    (above f3 f12)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f4 f9)
    (above f4 f10)
    (above f4 f11)
    (above f4 f12)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f5 f9)
    (above f5 f10)
    (above f5 f11)
    (above f5 f12)
    (above f6 f7)
    (above f6 f8)
    (above f6 f9)
    (above f6 f10)
    (above f6 f11)
    (above f6 f12)
    (above f7 f8)
    (above f7 f9)
    (above f7 f10)
    (above f7 f11)
    (above f7 f12)
    (above f8 f9)
    (above f8 f10)
    (above f8 f11)
    (above f8 f12)
    (above f9 f10)
    (above f9 f11)
    (above f9 f12)
    (above f10 f11)
    (above f10 f12)
    (above f11 f12)
    (lift-at f1)
  )

  (:goal (and
    (served p1)
    (served p2)
    (served p3)
    (served p4)
    (served p5)
    (served p6)
    (served p7)
    (served p8)
    (served p9)
    (served p10)
    (served p11)
    (served p12)
  ))
)

; plan
1. (board f1 p3)
   added: (boarded p3)
   goals met: 0 of 12
2. (board f1 p2)
   added: (boarded p2)
   goals met: 0 of 12
3. (up f1 f11)
   deleted: (lift-at f1)
   added: (lift-at f11)
   goals met: 0 of 12
4. (board f11 p4)
   added: (boarded p4)
   goals met: 0 of 12
5. (board f11 p9)
   added: (boarded p9)
   goals met: 0 of 12
6. (board f11 p11)
   added: (boarded p11)
   goals met: 0 of 12
7. (down f11 f9)
   deleted: (lift-at f11)
   added: (lift-at f9)
   goals met: 0 of 12
8. (depart f9 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 1 of 12
9. (down f9 f3)
   deleted: (lift-at f9)
   added: (lift-at f3)
   goals met: 1 of 12
10. (board f3 p7)
   added: (boarded p7)
   goals met: 1 of 12
11. (board f3 p12)
   added: (boarded p12)
   goals met: 1 of 12
12. (up f3 f10)
   deleted: (lift-at f3)
   added: (lift-at f10)
   goals met: 1 of 12
13. (board f10 p1)
   added: (boarded p1)
   goals met: 1 of 12
14. (down f10 f4)
   deleted: (lift-at f10)
   added: (lift-at f4)
   goals met: 1 of 12
15. (board f4 p8)
   added: (boarded p8)
   goals met: 1 of 12
16. (depart f4 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 2 of 12
17. (up f4 f12)
   deleted: (lift-at f4)
   added: (lift-at f12)
   goals met: 2 of 12
18. (board f12 p5)
   added: (boarded p5)
   goals met: 2 of 12
19. (depart f12 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 3 of 12
20. (down f12 f5)
   deleted: (lift-at f12)
   added: (lift-at f5)
   goals met: 3 of 12
21. (depart f5 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 4 of 12
22. (depart f5 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 5 of 12
23. (depart f5 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 6 of 12
24. (up f5 f7)
   deleted: (lift-at f5)
   added: (lift-at f7)
   goals met: 6 of 12
25. (depart f7 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 7 of 12
26. (down f7 f2)
   deleted: (lift-at f7)
   added: (lift-at f2)
   goals met: 7 of 12
27. (depart f2 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 8 of 12
28. (board f2 p6)
   added: (boarded p6)
   goals met: 8 of 12
29. (depart f2 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 9 of 12
30. (up f2 f6)
   deleted: (lift-at f2)
   added: (lift-at f6)
   goals met: 9 of 12
31. (depart f6 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 10 of 12
32. (board f6 p10)
   added: (boarded p10)
   goals met: 10 of 12
33. (depart f6 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 11 of 12
34. (down f6 f2)
   deleted: (lift-at f6)
   added: (lift-at f2)
   goals met: 11 of 12
35. (depart f2 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 12 of 12
